Repository: pingfangx/TranslatorX-other
Catalog: AndroidGuide/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: "true" if you want to perform the animation once; "false" to loop the animation.
zh_cn: 如果要执行一次动画，“true”；如果要循环动画，“false”。

source: "true" if you want to share the same interpolator among all child elements.
zh_cn: 如果要在所有子元素之间共享同一个插值器，请选择“true”。

source: (The ID android:id specified for the ViewStub is valid only until the ViewStub layout is visible/inflated.)
zh_cn: (为 ViewStub 指定的 IDandroid:id 仅在 ViewStub 布局可见/加载之前有效。)

source: (To learn more about defining an animation in your application code, instead of XML, refer to the AnimationSet class and other Animation subclasses.)
zh_cn: (要了解有关在应用程序代码中而不是 XML 中定义动画的更多信息，请参阅 AnimationSet 类和其他 animation 子类。)

source: 300 milliseconds is the default.
zh_cn: 默认为 300 毫秒。

source: 300ms is the default.
zh_cn: 默认为 300 毫秒。

source: A horizontal constraint to the parent
zh_cn: 相对于父布局的水平约束

source: The left side of a view is constrained to the left side of the parent
zh_cn: 一个 view 的左边限制为 parent 的左边。

source: ConstraintLayout allows you to create large and complex layouts with a flat view hierarchy (no nested view groups).
zh_cn: 翻译于：20170505 平方X 参考： [1]_SOLID.[译文]使用 ConstraintLayout 构建一个响应式的 UI.http://www.jianshu.com/p/f61227a2775f [2].weiyf.【双语】使用 ConstraintLayout 构建响应式 UI(Build a Responsive UI with ConstraintLayout).https://weiyf.cn/2017/03/10/Build%20a%20Responsive%20UI%20with%20ConstraintLayout/ ConstraintLayout 允许你使用平面 view 层次结构创建大而复杂的布局(没有嵌套 view groups)。

source: MotionLayout is a layout type that helps you manage motion and widget animation in your app.
zh_cn: MotionLayout 是一种布局类型，可以帮助你在你的应用程序管理运动和 widget 动画。

source: Content Providers that enable apps to access data from other apps, such as the Contacts app, or to share their own data
zh_cn: Content Providers 允许应用程序从其他应用程序(如联系人应用程序)访问数据，或共享自己的数据

source: Frame animation:
zh_cn: 帧动画:

source: Hierarchy Viewer shows a list of available devices and their running components.
zh_cn: Hierarchy Viewer 显示可用设备及其运行组件的列表。

source: Tween animation:
zh_cn: 补间动画:

source: Figure 3. The menu to convert a layout to ConstraintLayout
zh_cn: Figure 3. 将一个布局转换为 ConstraintLayout 的菜单

source: <ConstraintSet> is where you define the various constraints that describe your motion.
zh_cn: <ConstraintSet> 是定义描述运动的各种约束的地方。

source: <OnSwipe> lets you control the motion via touch.
zh_cn: <OnSwipe> 允许你通过触摸控制运动。

source: <Transition> contains the base definition of the motion.
zh_cn: <Transition> 包含运动的基本定义。

source: ValueAnimator does not carry out the second piece, so you must listen for updates to values calculated by the ValueAnimator and modify the objects that you want to animate with your own logic.
zh_cn: ValueAnimator 不执行第二个部分，因此必须侦听由 ValueAnimator 计算的值的更新，并使用自己的逻辑修改要设置动画的对象。

source: ViewStub is a lightweight view with no dimension that doesn’t draw anything or participate in the layout.
zh_cn: ViewStub 是一个轻量级视图，它没有尺寸，不会绘制任何内容或参与布局。

source: onMeasure() has no return value.
zh_cn: onMeasure() 没有返回值。

source: onSizeChanged() is called when your view is first assigned a size, and again if the size of your view changes for any reason.
zh_cn: 首次为 view 指定大小时，将调用 onSizeChanged()，如果 view 大小因任何原因发生更改，则会再次调用。

source: ConstraintLayout is used in the Sunflower demo app.
zh_cn: ConstraintLayout 在 Sunflower 演示应用程序被使用。

source: LinedEditText is defined as an inner class within the NoteEditor activity, but it is public so that it could be accessed as NoteEditor.LinedEditText from outside of the NoteEditor class if desired.
zh_cn: LinedEditText 被定义为 NoteEditor activity 中的内部类，但它是公共的，因此如果需要，可以使用 NoteEditor 类从外部访问 NoteEditor.LinedEditText 。

source: MotionLayout bridges the gap between layout transitions and complex motion handling, offering a mix of features between the property animation framework, TransitionManager, and CoordinatorLayout.
zh_cn: MotionLayout 弥合了布局转换和复杂运动处理之间的差距，提供了 property animation framework、TransitionManager 和 CoordinatorLayout 之间的混合功能。

source: MotionLayout is fully declarative, meaning that you can describe any transitions in XML, no matter how complex.
zh_cn: MotionLayout 是完全声明性的，这意味着你可以用 XML 描述任何转换，不管它有多复杂。

source: MotionLayout is intended to move, resize, and animate UI elements with which users interact, such as buttons and title bars.
zh_cn: MotionLayout 用于移动、调整用户与之交互的 UI 元素(如按钮和标题栏)并设置其动画。

source: app:applyMotionScene="boolean" indicates whether to apply the MotionScene.
zh_cn: app:applyMotionScene="boolean" 指示是否应用 MotionScene。

source: app:currentState="reference" lets you specify a specific ConstraintSet.
zh_cn: app:currentState="reference" 允许你指定特定的 ConstraintSet。

source: app:motionDebug lets you display additional debug information about the motion.
zh_cn: app:motionDebug 允许显示有关运动的其他调试信息。

source: app:progress="float" lets you explicitly specify transition progress.
zh_cn: app:progress="float" 允许你显式指定转换进度。

source: app:showPaths="boolean" indicates whether to show the motion paths as the motion is running.
zh_cn: app:showPaths="boolean" 指示是否在运动运行时显示运动路径。

source: motion:attributeName is required and must match an object with getter and setter methods.
zh_cn: motion:attributeName 是必需的，并且必须以获取和设置方法的对象相匹配。

source: motion:constraintSetStart and motionconstraintSetEnd are references to the endpoints of the motion.
zh_cn: motion:constraintSetStart 和 motionconstraintSetEnd 是对运动端点的引用。

source: motion:dragDirection refers to the progress direction of the drag.
zh_cn: motion:dragDirection 指拖动的 progress (进度) 方向。

source: motion:duration specifies the number of milliseconds that it takes for the motion to complete.
zh_cn: motion:duration 指定运动完成所需的毫秒数。

source: motion:touchAnchorId refers to the view that you can swipe and drag.
zh_cn: motion:touchAnchorId 指的是可以滑动和拖动的视图。

source: motion:touchAnchorSide means that we are dragging the view from the right side.
zh_cn: motion:touchAnchorSide 表示我们正在从右侧拖动视图。

source: onMeasure() is a little more involved.
zh_cn: onMeasure() 相关的东西更多一些。

source: android:repeatCount must be set to a positive integer or "-1" for this attribute to have an effect.
zh_cn: android:repeatCount 必须设置为正整数或 "-1"，此属性才能生效。

source: onMeasure() is a critical piece of the rendering contract between your component and its container.
zh_cn: onMeasure() 是组件和它的容器之间相关联的渲染的一个关键部分。

source: ValueAnimator changes the rotation over a period of several hundred milliseconds, rather than immediately setting the new rotation value.
zh_cn: ValueAnimator 会在几百毫秒的时间内更改旋转，而不是立即设置新的旋转值。

source: MotionLayout also supports keyframes, enabling fully customized transitions to suit your needs.
zh_cn: MotionLayout 还支持关键帧，支持完全自定义的过渡以满足你的需要。

source: MotionLayout is a subclass of ConstraintLayout and builds upon its rich layout capabilities.
zh_cn: MotionLayout 是 ConstraintLayout 子类，并建立在其丰富的布局功能。

source: MotionLayout is a subclass of ConstraintLayout, so you can transform any existing ConstraintLayout into a MotionLayout by replacing the class name in your layout resource file, as shown in the following examples:
zh_cn: MotionLayout 是 ConstraintLayout 一个子类，这样就可以改变任何现有的 ConstraintLayout 成 MotionLayout 通过更换类名在布局资源文件，如下面的例子：

source: onMeasure() should be overridden to efficiently and accurately report the measurements of its contained parts.
zh_cn: onMeasure() 应该重写来有效而准确地报告它容纳的部分的测量结果。

source: Canvas has a method to draw a rectangle, while Paint defines whether to fill that rectangle with a color or leave it empty.
zh_cn: Canvas 有一种绘制矩形的方法，而 Paint 定义是否用颜色填充该矩形或将它留空。

source: computeScrollOffset() updates the Scroller object's internal state by reading the current time and using the physics model to calculate the x and y position at that time.
zh_cn: computeScrollOffset() 通过读取当前时间并使用物理模型来计算 Scroller 对象的内部状态那时的 x 和 y 位置。

source: How to draw, handled by Paint.
zh_cn: 如何 绘制，由 Paint 处理。

source: What to draw, handled by Canvas
zh_cn: 绘制什么，由 Canvas 处理

source: Figure 1. The editor shows view C below A, but it has no vertical constraint
zh_cn: Figure 1. 编辑器显示 A 下面的 view C，但没有垂直约束

source: Figure 2. View C is now vertically constrained below view A
zh_cn: Figure 2. view C 现在垂直限制在 view A 下方

source: Figure 4. The Layout section of the Attributes window lets you create connections.
zh_cn: Figure 4. Attributes 窗口的 Layout 部分允许你创建连接。

source: Figure 5. A red constraint indicates that you can click to delete it.
zh_cn: Figure 5. 红色约束指示可以点击将其删除。

source: Figure 6. Click on a constraint anchor to delete it.
zh_cn: Figure 6. 点击一个约束锚将其删除。

source: Figure 8. A horizontal and vertical constraint
zh_cn: Figure 8. 水平和垂直约束

source: Figure 9. A horizontal alignment constraint
zh_cn: Figure 9. 水平对齐的约束

source: Note: Although the velocity calculated by GestureDetector is physically accurate, many developers feel that using this value makes the fling animation too fast.
zh_cn: Note: 虽然 GestureDetector 计算的速度在物理上是准确的，但许多开发人员认为使用此值会使投掷动画过快。

source: Note: This does not apply to 3D graphics.
zh_cn: Note: 这不适用于 3D 图形。

source: Note: You can use ValueAnimator in applications that target lower API levels.
zh_cn: Note: 你可以在目标较低 API 级别的应用程序中使用 ValueAnimator。

source: Note: Although intents are used for both sending broadcasts and starting activities with startActivity(Intent), these actions are completely unrelated.
zh_cn: Note: 虽然 intent 可用于发送广播和使用 startActivity(Intent) 启动 activity ，但这些操作完全无关。

source: Note: Custom permissions are registered when the app is installed.
zh_cn: Note: 安装应用程序时会注册自定义权限。

source: Note: If your app targets API level 26 or higher, you cannot use the manifest to declare a receiver for implicit broadcasts (broadcasts that do not target your app specifically), except for a few implicit broadcasts that are exempted from that restriction.
zh_cn: Note: 如果你的应用程序以 API 级别 26 或更高级别为目标，则不能使用清单为 implicit (隐式) 广播(不针对你的应用程序的广播)声明接收器，但有少数被 免除该限制的隐式广播除外。

source: Note: To register for local broadcasts, call LocalBroadcastManager.registerReceiver(BroadcastReceiver, IntentFilter) instead.
zh_cn: Note: 要注册本地广播，请调用 LocalBroadcastManager.registerReceiver(BroadcastReceiver, IntentFilter)。

source: Tip: Extension classes can be defined as inner classes inside the activities that use them.
zh_cn: Tip: 继承类可以在使用它们的 Activity 中定义为内部类。

source: Video 2. Adding a constraint that opposes an existing one
zh_cn: Video 2. 添加一个约束现有的约束

source: MotionLayout works only with its direct children.
zh_cn: MotionLayout 仅适用于其直接子级。

source: TransitionManager is available in the Support Library for Android 4.0 (API level 14) or higher.
zh_cn: TransitionManager 在支持库中 Android 4.0(API级14) 或可用更高。

source: ConstraintSet animations animate only the size and position of child elements.
zh_cn: ConstraintSet 动画仅设置子元素的大小和位置的动画。

source: Not using these components correctly can result in the system killing the application's process while it is doing important work.
zh_cn: 不正确使用这些组件可能导致系统在应用程序执行重要工作时终止其进程。

source: A Notification Manager that enables all apps to display custom alerts in the status bar
zh_cn: Notification Manager 允许所有应用程序在状态栏中显示自定义警报

source: A Resource Manager, providing access to non-code resources such as localized strings, graphics, and layout files
zh_cn: Resource Manage，提供访问非代码资源，如本地化字符串，图形，和布局文件

source: A vector drawable is a type of drawable that is scalable without getting pixelated or blurry.
zh_cn: vector drawable 是一种可缩放的 drawable，无需像素化或模糊化。

source: A <CustomAttribute> contains two attributes of its own:
zh_cn: <CustomAttribute> 包含自己的两个属性：

source: A ConstraintSet is a lightweight object that represents the constraints, margins, and padding of all child elements within a ConstraintLayout.
zh_cn: ConstraintSet 是一个轻量级对象，表示 ConstraintLayout 中所有子元素的约束、外边距和内边距。

source: A RelativeLayout as the root node allows for such layouts.
zh_cn: RelativeLayout 作为根节点允许这样的布局。

source: A background process is one holding an Activity that is not currently visible to the user (its onStop() method has been called).
zh_cn: 后台进程 保持一个 Activity 当前未对用户可见(其 onStop() 方法被调用)。

source: A cached process is one that is not currently needed, so the system is free to kill it as desired when memory is needed elsewhere.
zh_cn: 缓存进程 是当前不需要的进程，因此当其他地方需要内存时，系统可以根据需要终止它。

source: A foreground process is one that is required for what the user is currently doing.
zh_cn: 前台进程 是用户当前所做工作所必需的。

source: A service process is one holding a Service that has been started with the startService() method.
zh_cn: 服务进程 保持一个 Service 期已经由 startService() 方法启动。

source: A visible process is doing work that the user is currently aware of, so killing it would have a noticeable negative impact on the user experience.
zh_cn: 可见进程 正在做用户当前意识到的工作，因此终止它将对用户体验产生明显的负面影响。

source: A visible process is one holding an Activity that is visible to the user on-screen but not in the foreground (its onPause() method has been called).
zh_cn: 可见进程 是一个保持一个 Activity 是用户在屏幕上但不是在前台(可见其 onPause() 方法被调用)。

source: A MotionScene is an XML resource file that contains all of the motion descriptions for the corresponding layout.
zh_cn: MotionScene 是一个 XML 资源文件，包含对应布局的所有运动描述。

source: A baseline alignment constraint
zh_cn: 基线约束限制

source: A chain is a group of views that are linked to each other with bi-directional position constraints.
zh_cn: 链是用双向位置约束彼此链接的一组 view。

source: A chain works properly only if each end of the chain is constrained to another object on the same axis, as shown in figure 14.
zh_cn: 只有链的每一端都被约束到同一轴上的另一个对象，链才能正常工作，如图 14 所示。

source: A common example of a process life-cycle bug is a BroadcastReceiver that starts a thread when it receives an Intent in its BroadcastReceiver.onReceive() method, and then returns from the function.
zh_cn: 进程生命周期错误的一个常见示例是 BroadcastReceiver 当它在其 BroadcastReceiver.onReceive() 方法方法中接收到 Intent 时启动线程，然后从函数返回。

source: A container that holds other animation elements (<alpha>, <scale>, <translate>, <rotate>) or other <set> elements.
zh_cn: 保存其它动画元素(<alpha>，<scale>，<translate>，<rotate>)或其它 <set> 元素的容器。

source: A container that holds other animation elements (<objectAnimator>, <valueAnimator>, or other <set> elements).
zh_cn: 保存其他动画元素的容器(<objectAnimator>、<valueAnimator> 或其他 <set> 元素)。

source: A fade-in or fade-out animation.
zh_cn: 淡入或淡出动画。

source: A full reference to the kind of restrictions these specifications can require can be found in the reference documentation under View.onMeasure(int, int) (this reference documentation does a pretty good job of explaining the whole measurement operation as well).
zh_cn: 有关这种规格需要的限制的完整参考，可以在 View.onMeasure(int, int) 的参考文档中找到（这个参考也很好的解释了整个测量的操作）。

source: A good example of this is the fling gesture, where the user quickly moves a finger across the screen and then lifts it.
zh_cn: 一个很好的例子是 fling 手势，用户可以快速地在屏幕上移动手指，然后将其抬起。

source: A good rule to follow is to always expose any property that affects the visible appearance or behavior of your custom view.
zh_cn: 要遵循的一个好规则是始终公开任何影响自定义 view 的可见外观或行为的属性。

source: A horizontal alignment constraint
zh_cn: 水平对齐的约束

source: A horizontal and vertical constraint
zh_cn: 水平和垂直约束

source: A horizontal chain with two views
zh_cn: 有两个视图的水平链

source: A lot of physics and math are required to get a flywheel model working correctly.
zh_cn: 需要大量的物理和数学才能使飞轮模型正常工作。

source: A more sophisticated component may override even more on... methods and introduce some of its own helper methods, substantially customizing its properties and behavior.
zh_cn: 一个更复杂的组件可以重写更多的 on... 方法，并引入一些自己的助手方法，充分地自定义自己的属性和行为。

source: A partial list of available widgets includes Button, TextView, EditText, ListView, CheckBox, RadioButton, Gallery, Spinner, and the more special-purpose AutoCompleteTextView, ImageSwitcher, and TextSwitcher.
zh_cn: 部分可用的控件列表包括 Button, TextView, EditText, ListView, CheckBox, RadioButton, Gallery, Spinner，以及更多特殊目的的控件如 AutoCompleteTextView, ImageSwitcher,TextSwitcher 等。

source: A process is considered to be in the foreground if any of the following conditions hold:
zh_cn: 如果满足以下任一条件，则认为进程处于前台：

source: A process is considered visible in the following conditions:
zh_cn: 在下列条件下，进程被视为可见进程：

source: A process's priority may also be increased based on other dependencies a process has to it.
zh_cn: 进程的优先级也可以根据进程对它的其他依赖关系而增加。

source: A property animation changes a property's (a field in an object) value over a specified length of time.
zh_cn: 属性动画在指定的时间长度内更改属性(对象中的字段)值。

source: A red constraint indicates that you can click to delete it.
zh_cn: 红色约束指示可以点击将其删除。

source: A resizing animation.
zh_cn: 缩放动画。

source: A rich and extensible View System you can use to build an app’s UI, including lists, grids, text boxes, buttons, and even an embeddable web browser
zh_cn: 一个丰富且可扩展的View 系统，可以用来构建应用程序的 UI，包括列表、网格、文本框、按钮，甚至是一个可嵌入的 web 浏览器。

source: A rotation animation.
zh_cn: 旋转动画。

source: A sequence of animation instructions defines the tween animation, defined by either XML or Android code.
zh_cn: 动画指令序列定义了由 XML 或 Android 代码定义的补间动画。

source: A single frame of animation.
zh_cn: 动画的单个帧。

source: A subclass of ValueAnimator that allows you to set a target object and object property to animate.
zh_cn: ValueAnimator 的一个子类，允许你设置要设置动画的目标对象和对象属性。

source: A subtle animation when a dialog appears and disappears makes the UI change less jarring
zh_cn: 当一个对话框出现或消失时，一个微妙的动画可以使用户界面的变化不那么突兀

source: A time interpolator defines how specific values in an animation are calculated as a function of time.
zh_cn: 时间插值器定义如何将动画中的特定值计算为时间的函数。

source: A tween animation can perform a series of simple transformations (position, size, rotation, and transparency) on the contents of a View object.
zh_cn: 补间动画可以对视图对象的内容执行一系列简单的变换(位置、大小、旋转和透明度)。

source: A vector drawable with the <vector> element in res/drawable/
zh_cn: res/drawable/ 中使用 <vector> 元素声明的 vector drawable

source: A vertical and/or horizontal motion.
zh_cn: 垂直和/或水平运动。

source: A view can be a part of both a horizontal and a vertical chain, making it easy to build flexible grid layouts.
zh_cn: view 可以是水平和垂直链的一部分，使得构建灵活的网格布局变得容易。

source: A view constrained to a guideline
zh_cn: view 的参考线约束

source: A well-designed custom view is much like any other well-designed class.
zh_cn: 精心设计的自定义 view 与任何其他精心设计的类非常相似。

source: API overview
zh_cn: API 概览

source: ART is written to run multiple virtual machines on low-memory devices by executing DEX files, a bytecode format designed specially for Android that's optimized for minimal memory footprint.
zh_cn: ART 是通过执行 DEX 文件来运行低内存设备上的多个虚拟机的，DEX 文件是专为 Android 设计的字节码格式，它优化了最小的内存占用。

source: About system broadcasts
zh_cn: 关于系统广播

source: Add ConstraintLayout to your project
zh_cn: 添加 ConstraintLayout 到我们的项目中

source: Add Properties and Events
zh_cn: 添加属性和事件

source: Add a <CustomAttribute> element to each ConstraintSet elements, as shown below:
zh_cn: 将 <CustomAttribute> 元素添加到每个 ConstraintSet 元素，如下所示：

source: Add or remove a constraint
zh_cn: 添加或移除约束

source: Add the library as a dependency in the same build.gradle file, as shown in the following example.
zh_cn: 在相同的 build.gradle 文件中将库添加为依赖，如下面的例子所示。

source: Adding a constraint that opposes an existing one
zh_cn: 添加一个约束现有的约束

source: Additional MotionLayout attributes
zh_cn: 其他 MotionLayout 属性

source: Additional resources
zh_cn: 其他资源

source: Adjust the constraint bias
zh_cn: 调整约束偏差

source: Adjust the view margins
zh_cn: 调整 view 边距

source: Adjust the view size
zh_cn: 调整 view 的大小

source: Adjusting the constraint bias
zh_cn: 调整约束偏移

source: Admittedly this is a simple case, but that's the point — creating custom components is only as complicated as you need it to be.
zh_cn: 诚然，这只是一个简单的例子，但关键是——创建自定义 view 你需要有多复杂，就创建成多复杂。

source: After onReceive(), the system can kill the process at any time to reclaim memory, and in doing so, it terminates the spawned thread running in the process.
zh_cn: 在 onReceive() 之后，系统可以随时终止进程以回收内存，并在这样做时终止进程中运行的派生线程。

source: Afterwards, you need to update the Scroller by calling Scroller.computeScrollOffset() at regular intervals.
zh_cn: 之后，你需要定期调用 Scroller.computeScrollOffset() 来更新 Scroller。

source: Ahead-of-time (AOT) and just-in-time (JIT) compilation
zh_cn: 提前编译(Ahead-of-time (AOT)) 和即时编译(just-in-time (JIT))

source: Align the edge of a view to the same edge of another view.
zh_cn: 将 view 的边缘与另一个 view 的相同边缘对齐。

source: Align the text baseline of a view to the text baseline of another view.
zh_cn: 将 view 的文本基线与另一个 view 的文本基线对齐。

source: Alignment
zh_cn: 对齐

source: All interpolators available in Android are subclasses of the Interpolator class.
zh_cn: Android 中可用的所有插值器是 Interpolator 类的子类。

source: All margins offered by the tool are factors of 8dp to help your views align to Material Design's 8dp square grid recommendations.
zh_cn: 该工具提供的所有边距默认是 8dp，以帮助你的 view 符合 Material Design 的 8dp square grid recommendations 建议。

source: All of the view classes defined in the Android framework extend View.
zh_cn: Android 框架中定义的所有 view 类都继承了 View。

source: All the power of ConstraintLayout is available directly from the Layout Editor's visual tools, because the layout API and the Layout Editor were specially built for each other.
zh_cn: ConstraintLayout 的所有功能都可以从布局编辑器的可视化工具中直接获得，因为布局 API 和布局编辑器是专为彼此构建的。

source: All you need to do is specify the starting and ending layout, and what type of animation you want to use.
zh_cn: 你只需指定开始和结束布局，以及要使用的动画类型。

source: Allocate objects during initialization, or between animations.
zh_cn: 在初始化期间或动画之间分配对象。

source: Also, apps targeting Android 7.0 and higher must register the CONNECTIVITY_ACTION broadcast using registerReceiver(BroadcastReceiver, IntentFilter).
zh_cn: 此外，针对 Android 7.0 及更高版本的应用程序必须使用 registerReceiver(BroadcastReceiver, IntentFilter) 注册 CONNECTIVITY_ACTION 广播。

source: Although View has many methods for handling measurement, most of them do not need to be overridden.
zh_cn: 虽然 View 有许多处理测量的方法，但大多数方法都不需要重写。

source: Although Android offers a variety of widgets to provide small and re-usable interactive elements, you might also need to re-use larger components that require a special layout.
zh_cn: 尽管 Android 提供了各种小部件来提供小的、可重用的交互元素，但你可能还需要重用需要特殊布局的较大组件。

source: Although a missing constraint won't cause a compilation error, the Layout Editor indicates missing constraints as an error in the toolbar.
zh_cn: 尽管缺少了约束也不会造成编译错误，布局编辑器将会在工具栏上显示有一个缺少约束的错误。

source: Although it's not strictly necessary to follow this convention, many popular code editors depend on this naming convention to provide statement completion.
zh_cn: 尽管遵循此约定并非绝对必要，但许多流行的代码编辑器依赖于此命名约定来提供语句补全。

source: Although it's possible to read values from the AttributeSet directly, doing so has some disadvantages:
zh_cn: 虽然可以直接从 AttributeSet 中读取值，但这样做有一些缺点：

source: Although the orientation of a chain is either vertical or horizontal, using one does not align the views in that direction.
zh_cn: 虽然链的取向是垂直或水平的，无论使用哪一个一个方向都不会使该方向上的视图对齐。

source: Among the layouts available are LinearLayout, FrameLayout, RelativeLayout, and others.
zh_cn: 可用的布局包括 LinearLayout, FrameLayout, RelativeLayout 及其他。

source: Among them is extending an EditText View to make a lined notepad.
zh_cn: 其中包括继承 EditText 视图以制作一个 lined notepad。

source: An Activity Manager that manages the lifecycle of apps and provides a common navigation back stack
zh_cn: Activity Manager 它管理应用程序的生命周期，并提供一个通用的 导航返回栈

source: An Interpolator to apply on the animation.
zh_cn: 要应用于动画的 Interpolator。

source: An empty process is one that doesn't hold any active application components.
zh_cn: 空进程 是一个不持有任何活动应用组件的进程。

source: An animated vector drawable with the <animated-vector> element in res/drawable/
zh_cn: res/drawable/ 中使用 <animated-vector> 元素声明的 animated vector drawable

source: An animation defined in XML that modifies properties of the target object, such as background color or alpha value, over a set amount of time.
zh_cn: 用 XML 定义的一种动画，在一定时间内修改目标对象的属性，如背景色或 alpha 值。

source: An animation defined in XML that performs transitions such as rotating, fading, moving, and stretching on a graphic.
zh_cn: XML 中定义的一种动画，在图形上执行诸如旋转、淡入、移动和拉伸等过渡。

source: An animation defined in XML that shows a sequence of images in order (like a film).
zh_cn: 在 XML 中定义的动画，按顺序显示一系列图像(如电影)。
